Конфигурация/Проверка/Documents/ИнвентаризацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ИнвентаризацияТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетноеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическоеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНедостачиИзлишков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Проверка/Documents/ИнвентаризацияТоваров/Ext/ObjectModule.bsl
// --- АВТОМАТИЧЕСКИЙ РАСЧЕТ ПЕРЕД ЗАПИСЬЮ ---
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для Каждого ТекСтрока Из Товары Цикл
		// Отклонение = Факт - Учет
		ТекСтрока.Отклонение = ТекСтрока.ФактическоеКоличество - ТекСтрока.УчетноеКоличество;
		// Сумма недостачи/излишков = Отклонение × Цена
		ТекСтрока.СуммаНедостачиИзлишков = ТекСтрока.Отклонение * ТекСтрока.Цена;
	КонецЦикла;
	
КонецПроцедуры

// --- ЗАПОЛНЕНИЕ ПО ОСТАТКАМ ---
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Заполнение склада при вводе на основании (если будет) или интерактивно
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Склады") Тогда
		Склад = ДанныеЗаполнения;
	КонецЕсли;
	
	// Если склад выбран, а таблица пуста — заполняем автоматически
	Если ЗначениеЗаполнено(Склад) И Товары.Количество() = 0 Тогда
		ЗаполнитьПоОстаткам();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоОстаткам() Экспорт
	
	// Сохраняем уже введенные фактические количества ДО очистки
	СохраненныеФактическиеКоличества = Новый Соответствие;
	Для Каждого Стр Из Товары Цикл
		Если Стр.ФактическоеКоличество <> 0 Тогда
			СохраненныеФактическиеКоличества.Вставить(Стр.Номенклатура, Стр.ФактическоеКоличество);
		КонецЕсли;
	КонецЦикла;
	
	// Очищаем табличную часть
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК УчетноеКоличество
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&Период, Склад = &Склад) КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоОстаток <> 0";
	
	// Если документ новый (Ссылка пустая) — берем текущую дату, иначе дату документа
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Ссылка), Дата, ТекущаяДата()));
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Результат = Запрос.Выполнить();
	Товары.Загрузить(Результат.Выгрузить());
	
	// Восстанавливаем сохраненные фактические количества или ставим 0
	Для Каждого Стр Из Товары Цикл
		СохраненноеЗначение = СохраненныеФактическиеКоличества.Получить(Стр.Номенклатура);
		Если СохраненноеЗначение <> Неопределено Тогда
			// Восстанавливаем ранее введенное значение
			Стр.ФактическоеКоличество = СохраненноеЗначение;
			// Удаляем из соответствия - уже обработали
			СохраненныеФактическиеКоличества.Удалить(Стр.Номенклатура);
		Иначе
			// Новый товар - ставим 0
			Стр.ФактическоеКоличество = 0;
		КонецЕсли;
		
		// Заполняем закупочную цену
		Стр.Цена = ПолучитьЗакупочнуюЦену(Стр.Номенклатура);
		Стр.Сумма = Стр.ФактическоеКоличество * Стр.Цена;
		Стр.Отклонение = Стр.ФактическоеКоличество - Стр.УчетноеКоличество;
		Стр.СуммаНедостачиИзлишков = Стр.Отклонение * Стр.Цена;
	КонецЦикла;
	
	// Добавляем товары, которых нет в остатках, но были введены фактические количества
	Для Каждого КлючЗначение Из СохраненныеФактическиеКоличества Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура = КлючЗначение.Ключ;
		НоваяСтрока.УчетноеКоличество = 0; // В остатках нет
		НоваяСтрока.ФактическоеКоличество = КлючЗначение.Значение;
		НоваяСтрока.Цена = ПолучитьЗакупочнуюЦену(НоваяСтрока.Номенклатура);
		НоваяСтрока.Сумма = НоваяСтрока.ФактическоеКоличество * НоваяСтрока.Цена;
		НоваяСтрока.Отклонение = НоваяСтрока.ФактическоеКоличество - НоваяСтрока.УчетноеКоличество;
		НоваяСтрока.СуммаНедостачиИзлишков = НоваяСтрока.Отклонение * НоваяСтрока.Цена;
	КонецЦикла;
	
КонецПроцедуры

// --- ПОЛУЧЕНИЕ ЗАКУПОЧНОЙ ЦЕНЫ ---

Функция ПолучитьЗакупочнуюЦену(Номенклатура)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат 0;
	КонецЕсли;
	
	// Получаем закупочную цену из регистра ЦеныНоменклатуры с типом "Закупочная"
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|\tЦеныНоменклатуры.Цена КАК Цена
		|ИЗ
		|\tРегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|ГДЕ
		|\tЦеныНоменклатуры.Номенклатура = &Номенклатура
		|\tИ ЦеныНоменклатуры.ТипЦен = &ТипЦен";
	
	Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦен.Закупочная);
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат 0; // Нет цены для этого товара
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Цена;
	
КонецФункции

// --- ПРОВЕДЕНИЕ ---
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	// Формируем движения на разницу
	Для Каждого ТекСтрока Из Товары Цикл
		
		Если ТекСтрока.Отклонение = 0 Тогда
			Продолжить; // Расхождений нет
		КонецЕсли;
		
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекСтрока.Номенклатура;
		
		Если ТекСтрока.Отклонение > 0 Тогда
			// ИЗЛИШКИ (Нашли больше, чем было) -> Приход
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Количество = ТекСтрока.Отклонение;
			
		Иначе // Отклонение < 0
			// НЕДОСТАЧА (Не хватает) -> Расход
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Количество = -ТекСтрока.Отклонение; // Минус на минус дает плюс (нам нужно положительное число в поле Количество)
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
